Revit 2024 API
ClassificationEntry.HasBadLevel Method
 Checks if the level is an integer in range between 1 and 5 inclusive.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool HasBadLevel()
Visual Basic
Public Function HasBadLevel As Boolean
Visual C++
public:
bool HasBadLevel()
Return Value
 True if the level is not an integer from 1 to 5 inclusive. False otherwise.
See Also
ClassificationEntry Class
Autodesk.Revit.DB Namespace